var x = 6;
var y = 14;
var z = 4;
x += y - x++ * z;
document.write(x + "<br/><hr/>")
// спочатку рахується х++*z тут приорітет більший і це дорівнює 24. далі y-x++*z і це = -10 адже у - більший приорітет ніж у +=. і далі до цього додаємо x і виходить 6+(-10)=-4
z = --x - y * 5 ;
document.write(z + "<br/><hr/>")
// --x = -5 так як попередній х=-4 і --х означає відразу добавляємо -1 тому -4-1=-5, і далі --х віднімаємо y*(14*5=70) і виходить -5-70=-75
/*y /= x + 5 % z;
document.write(y + "<br/><hr/>") тут у мене виходить безкінечність і я не розумію чому, я закоментувала це щоб в подальших прикладах із за значення мені не показувало значення безкінечності*/
result = z - x++ + y * 5;
document.write(result + "<br/><hr/>")
// z-x++=-70(-75-5=-70) і y*5=70(14*5=70) тому -70+70=0
x = y - x++ * z;
document.write(x + "<br/><hr/>")
// x++=-4 тому що перед цим було -5 і зараз ми додаємо +1, -4*-z(75)=300 і y(14)-300=286